---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.Camera.HorizontalOffset
source: html/a8acbc57-e0dd-2eba-7b3f-8c09ed08fc1c.htm
---
# Autodesk.Revit.DB.DirectContext3D.Camera.HorizontalOffset Property

Horizontal offset of the camera's view center from target, measured at target distance.

## Syntax (C#)
```csharp
public double HorizontalOffset { get; set; }
```